<?php
/**
 * Created by PhpStorm.
 * User: kevin
 * Date: 2017/4/26
 * Time: 下午10:52
 */
return [
    '0' => '请登录',
    '1' => '请求成功',
    '2' => '非法访问',

    /*
     * 基础功能
     */
    '1001' => 'accessToken错误',
    '1002' => '签名错误',
    '1003' => '系统错误',
    '1004' => '参数错误',
    '1005' => '暂无数据',
    '1006' => '没有权限',
    '1007' => '查询成功',
    '1008' => '添加成功',
    '1009' => '更新成功',
    '1010' => '删除成功',
    '1011' => '参数不全，请检查',
    '1012' => '提交成功',
    '1013' => '提交失败',
    '1014' => '操作失败',
    '1015' => '操作成功',
    '1016' => '请带上系统类型',
    '1017' => '修改成功',
    '1018' => '修改失败',
    '1019' => '信息不存在',
    '1020' => '请不要重复提交',
    '1021' => '上传失败',
    '1022' => '上传成功',
    '1023' => '删除失败',
    '1024' => '添加失败',
    '1025' => '更新失败',
    '1026' => 'jwt验证失败',
];